## DataFrame- İndex Değiştirme

In [1]:
import numpy as np
import pandas as pd

In [2]:
bilgi = np.random.randn(4,4)

In [3]:
bilgi

array([[ 1.57634783,  0.42129377,  0.05538261, -1.692297  ],
       [ 1.59773397, -1.25003668, -0.2394703 , -0.57860154],
       [-0.35897375,  1.39976385, -0.72978958, -0.85142002],
       [ 1.46950476,  0.85996143, -0.14812111,  0.39790851]])

In [4]:
yeniDataFrame = pd.DataFrame(data = bilgi, index = ["Ahmet", "Mehmet","Cenk","Güven"], columns=["Ev", "Araba","Yat","Arazi"])

In [5]:
yeniDataFrame

              Ev     Araba       Yat     Arazi
Ahmet   1.576348  0.421294  0.055383 -1.692297
Mehmet  1.597734 -1.250037 -0.239470 -0.578602
Cenk   -0.358974  1.399764 -0.729790 -0.851420
Güven   1.469505  0.859961 -0.148121  0.397909

In [6]:
yeniDataFrame.loc["Güven"]

Ev       1.469505
Araba    0.859961
Yat     -0.148121
Arazi    0.397909
Name: Güven, dtype: float64

In [7]:
yeniDataFrame.iloc[2]

Ev      -0.358974
Araba    1.399764
Yat     -0.729790
Arazi   -0.851420
Name: Cenk, dtype: float64

In [8]:
# Eğer indeksleri değiştirmek istiyorsak

In [9]:
yeniDataFrame

              Ev     Araba       Yat     Arazi
Ahmet   1.576348  0.421294  0.055383 -1.692297
Mehmet  1.597734 -1.250037 -0.239470 -0.578602
Cenk   -0.358974  1.399764 -0.729790 -0.851420
Güven   1.469505  0.859961 -0.148121  0.397909

## İndex değiştirme- yeniDataframe.set_index["Yeni index"] = yeniİndexListesi

In [10]:
yeniIndexlistesi = ["Ah", "Me","Ce","Gü"]

In [11]:
yeniDataFrame["Yeni İndex Listesi"] = yeniIndexlistesi

In [12]:
yeniDataFrame

              Ev     Araba       Yat     Arazi Yeni İndex Listesi
Ahmet   1.576348  0.421294  0.055383 -1.692297                 Ah
Mehmet  1.597734 -1.250037 -0.239470 -0.578602                 Me
Cenk   -0.358974  1.399764 -0.729790 -0.851420                 Ce
Güven   1.469505  0.859961 -0.148121  0.397909                 Gü

In [13]:
yeniDataFrame.set_index("Yeni İndex Listesi")

                          Ev     Araba       Yat     Arazi
Yeni İndex Listesi
Ah                  1.576348  0.421294  0.055383 -1.692297
Me                  1.597734 -1.250037 -0.239470 -0.578602
Ce                 -0.358974  1.399764 -0.729790 -0.851420
Gü                  1.469505  0.859961 -0.148121  0.397909

In [14]:
## ANCAK BURADA ESKİ HALİNE GERİ DÖNECEKTİR, inplace= False!!!!!!!!!!!!!!!!

## yenidataFrame.set_index("Yeniindex",inplace= True) kalıcı olarak değiştirir

In [16]:
yeniDataFrame

              Ev     Araba       Yat     Arazi Yeni İndex Listesi
Ahmet   1.576348  0.421294  0.055383 -1.692297                 Ah
Mehmet  1.597734 -1.250037 -0.239470 -0.578602                 Me
Cenk   -0.358974  1.399764 -0.729790 -0.851420                 Ce
Güven   1.469505  0.859961 -0.148121  0.397909                 Gü

In [17]:
yeniDataFrame.set_index("Yeni İndex Listesi", inplace=True)

In [18]:
yeniDataFrame

                          Ev     Araba       Yat     Arazi
Yeni İndex Listesi
Ah                  1.576348  0.421294  0.055383 -1.692297
Me                  1.597734 -1.250037 -0.239470 -0.578602
Ce                 -0.358974  1.399764 -0.729790 -0.851420
Gü                  1.469505  0.859961 -0.148121  0.397909

In [19]:
yeniDataFrame

                          Ev     Araba       Yat     Arazi
Yeni İndex Listesi
Ah                  1.576348  0.421294  0.055383 -1.692297
Me                  1.597734 -1.250037 -0.239470 -0.578602
Ce                 -0.358974  1.399764 -0.729790 -0.851420
Gü                  1.469505  0.859961 -0.148121  0.397909

In [21]:
yeniDataFrame.loc["Ah"] # yeni indeksleme çalışıyor

Ev       1.576348
Araba    0.421294
Yat      0.055383
Arazi   -1.692297
Name: Ah, dtype: float64